Per your suggestions... and it's no rush. I'm just happy to report back whatever issues I encounter.
```txt
resource "prowlarr_indexer" "usenet_nzbgeek" {
  enable          = true
  name            = "NZBgeek2"
  implementation  = "Newznab"
  config_contract = "NewznabSettings"
  app_profile_id  = 1
  protocol        = "usenet"
  priority        = 1
  tags            = []

  fields = [
    {
      name       = "baseUrl"
      text_value = "https://api.nzbgeek.info"
    },
    {
      name       = "apiPath"
      text_value = "/api"
    },
    {
      name            = "apiKey"
      sensitive_value = "${data.sops_file.servarr-secrets.data["nzbgeek_api_key"]}"
    },
    {
      name       = "vipExpiration"
      text_value = "2029-04-01"
    }
  ]
}
```

```bash
$ tf state rm $(tf state list | fzf)

Removed prowlarr_indexer.usenet_nzbgeek
Successfully removed 1 resource instance(s).
```
```bash
$ tfau
data.sops_file.servarr-secrets: Reading...
[...] # Removed for brevity

Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # prowlarr_indexer.usenet_nzbgeek will be created
  + resource "prowlarr_indexer" "usenet_nzbgeek" {
      + app_profile_id  = 1
      + config_contract = "NewznabSettings"
      + enable          = true
      + fields          = (sensitive value)
      + id              = (known after apply)
      + implementation  = "Newznab"
      + language        = (known after apply)
      + name            = "NZBgeek2"
      + priority        = 1
      + privacy         = (known after apply)
      + protocol        = "usenet"
      + tags            = []
    }

Plan: 1 to add, 0 to change, 0 to destroy.
prowlarr_indexer.usenet_nzbgeek: Creating...

| Error: Client Error
|
|   with prowlarr_indexer.usenet_nzbgeek,
|   on indexers.tf line 1, in resource "prowlarr_indexer" "usenet_nzbgeek":
|    1: resource "prowlarr_indexer" "usenet_nzbgeek" {
|
| Unable to create indexer, got error: 400 Bad Request
| Details:
| [
|   {
|     "propertyName": "Name",
|     "errorMessage": "Should be unique",
|     "attemptedValue": "NZBgeek2",
|     "severity": "error",
|     "errorCode": "PredicateValidator",
|     "formattedMessageArguments": [],
|     "formattedMessagePlaceholderValues": {
|       "PropertyName": "Name",
|       "PropertyValue": "NZBgeek2"
|     }
|   }
| ]
```